app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    #stores article record in an instance variable:
    @article = Article.find(params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2021-01-17 21:20:18.388983"], ["id", 1]]
---
  def update
    #1. Query the database for the Article record that matches the :id passed to the route.
    #2. Store the query in an instance variable.
    @article = Article.find(params[:id])
    #3. Update the values passed from the form (the update method here is the update method supplied by Active Record, not the update method we're creating). The update method takes a hash of the attributes for the model as its argument, e.g. `Article.find(1).update(title: "I'm Changed", description: "And here too!")
    #4. Save the changes in the database.
    @article.update(title: params[:article][:title], description: params[:article][:description])